STUDENTS/app/views/talents/show.html.erb

	<strong>Students with this talent:</strong>
	<%= @talent.students.map {|x| x.to_label}.join ', ' %>
---
SELECT "students".* FROM "students" INNER JOIN "students_talents" ON "students"."id" = "students_talents"."student_id" WHERE "students_talents"."talent_id" = ?  [["talent_id", 1]]