STUDENTS/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("first", "last", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first", "John"], ["last", "Smith"], ["email", "js@gmail.com"], ["created_at", "2015-12-02 20:15:35.891637"], ["updated_at", "2015-12-02 20:15:35.891637"]]