STUDENTS/app/controllers/talents_controller.rb

  def index
    @talents = Talent.all
---
SELECT "talents".* FROM "talents"

  def create
    @talent = Talent.new(talent_params)

    respond_to do |format|
      if @talent.save
---
INSERT INTO "talents" ("talent", "created_at", "updated_at") VALUES (?, ?, ?)  [["talent", "Running"], ["created_at", "2015-12-02 20:18:35.806560"], ["updated_at", "2015-12-02 20:18:35.806560"]]

    def set_talent
      @talent = Talent.find(params[:id])
---
SELECT  "talents".* FROM "talents" WHERE "talents"."id" = ? LIMIT 1  [["id", 2]]