BOOKS/app/views/books/show.html.erb

	<strong>Who owns a copy?</strong>
	<%= @book.users.map {|x| x.to_label}.join ', ' %>
---
SELECT  "users".* FROM "users" INNER JOIN "books_users" ON "users"."id" = "books_users"."user_id" WHERE "books_users"."book_id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["book_id", 2]]