BOOKS/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "C Programming"], ["author", "Doe"], ["created_at", "2015-11-23 21:09:37.316946"], ["updated_at", "2015-11-23 21:09:37.316946"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "Doeb"], ["updated_at", "2015-11-30 06:07:12.663294"], ["id", 1]]