BOOKS/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bob Yellow"], ["zip", 93010], ["created_at", "2015-11-23 21:10:36.904096"], ["updated_at", "2015-11-23 21:10:36.904096"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save